#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>

//int main()
//{
//	int a = 7 % 2;// 7/2...1
//	int b = 7 / 2;
//	printf("%d\n", a);//1
//	printf("%d\n", b);//3
//	return 0;
//}

//% 取模操作符的两端必须是整数

//13
//二进制
// 0~1
// 
//8进制
// 0~7
// 
//10进制
//0~9
// 
//16进制
//0~9  a~f

//整数的二进制表示有3种
//原码
//反码
//补码

//正的整数的原码、反码、补码相同
//负的整数的原码、反码、补码是要计算的

//7
//00000000000000000000000000000111 - 原码
//00000000000000000000000000000111 - 反码
//00000000000000000000000000000111 - 补码

//-7
//10000000000000000000000000000111 - 原码
//11111111111111111111111111111000 - 反码（原码的符号位不变，其它位按位取反就是反码）
//11111111111111111111111111111001 - 补码（反码 +1 就是补码）

//整数在内存中存储的是补码

//int main()
//{
//	int a = -7;
//
//	//左移操作符
//	//移动的是二进制位
//
//	int b = a << 1;
//
//	printf("a = %d\n", a);
//	printf("b = %d\n", b);
//
//	return 0;
//}

//int main()
//{
//	//float f = 3.14f;
//	//float f2 = f << 1;//不支持
//
//	return 0;
//}

//int main()
//{
//	int a = -7;
//	int b = a >> 1;
//
//	int c = a >> -2;//err
//	printf("a = %d\n", a);
//	printf("b = %d\n", b);
//
//	return 0;
//}



// & - 按（2进制）位与
// | - 按（2进制）位或
// ^ - 按（2进制）位异或 - 相同为0，相异为1
//int main()
//{
//	int a = 3;
//	int b = -5;
//	int c = a ^ b;
//	//00000000000000000000000000000011 - 3的补码
//	//10000000000000000000000000000101
//	//11111111111111111111111111111010
//	//11111111111111111111111111111011 - -5的补码
//	//00000000000000000000000000000011 - 3的补码
//	//11111111111111111111111111111000 - ^ 的计算结果
//
//	// %d 意味着打印一个有符号的整数
//	
//	printf("c = %d\n", c);
//
//	return 0;
//}

//不能创建临时变量（第三个变量），实现两个数的交换

//3^3 = 0 - > a^a=0
//011
//011
//000
//0^5 = 5 - > 0^a=0
//000
//101
//101

//3^3^5 = 5
//3^5^3 = 5
//异或操作符支持交换律

//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	printf("交换前：a=%d b=%d", a, b);
//	a = a ^ b;//a=3^5
//	b = a ^ b;//3^5^5 --> b=3
//	a = a ^ b;//3^5^3 --> a=5
//	printf("交换后：a=%d b=%d", a, b);
//
//	return 0;
//}
 
//int main()
//{
//	int a = 3;
//	int b = 5;
//	//这种方法会有溢出的问题
//	printf("交换前：a=%d b=%d", a, b);
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	printf("交换后：a=%d b=%d", a, b);
//
//	return 0;
//}


//编写代码实现：求一个整数存储在内存中的二进制中 1 的个数
//求补码的二进制中 1 的个数

//int a = 3;
//00000000000000000000000000000011

//a&1
//00000000000000000000000000000011
//00000000000000000000000000000001
//00000000000000000000000000000001

//int main()
//{
//	int a = 3;//初识化
//
//	int b = 0;
//	b = 20;//赋值
//
//	//赋值操作符可以连续使用
//	//int a = 10;
//	//int x = 0;
//	//int y = 20;
//	//a = x = y + 1;//连续赋值
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	a = a + 5;
//	a += 5;
//
//	a = a >> 1;
//	a >>= 1;
//
//	return 0;
//}

//int main()
//{
//	int flag = 3;
//	//flag为真，进入if
//	if (flag)
//	{ }
//
//	//flag为假，进入if
//	if(!flag)
//	{ }
//
//	return 0;
//}
//C语言中0表示假，非0表示真


//int main()
//{
//	//int a = 0;
//	//// ~ 是按二进制位取反
//	////00000000000000000000000000000000 - 补码
//	////11111111111111111111111111111111 -> ~a
//	////11111111111111111111111111111110  减 1
//	////10000000000000000000000000000001
//	////-1
//	//printf("%d\n", ~a);
//
//	//int a = 3;
//	//00000000000000000000000000000011 - 补码
//	//11111111111111111111111111111100 -> ~a
//	//11111111111111111111111111111011  减 1
//	//10000000000000000000000000000100
//	//-4
//	//printf("%d\n", ~a);
//
//	return 0;
//}


//int main()
//{
//	int a = 3;
//	//int b = ++a;//前置++，先++，后使用
//	//a = a + 1,b = a;
//
//	int b = a++;//后置++，先使用，再++
//	//b = a,a = a + 1;
//
//	//-- 和 ++ 一个道理
//
//	printf("%d\n", a);
//	printf("%d\n", b);
//
//	return 0;
//}


//int main()
//{
//	int a = 10;
//	int* p = &a;
//	*p = 20; //a = 20;
//	printf("%d\n", a);
//
//	return 0;
//}


//int main()
//{
//	//srand((unsigned int)time(NULL));
//	int a = (int)3.14;
//	printf("%d\n", a);
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	printf("%d\n", sizeof(a));
//	printf("%d\n", sizeof(int));
//
//	printf("%d\n", sizeof a);//ok
//
//	//printf("%d\n", sizeof int);//err
//
//	return 0;
//}
//sizeof是操作符，不是函数
//strlen是库函数，是用来求字符串长度的

//int main()
//{
//	if (3 == 5)
//	{
//
//	}
//	if ("abc" == "abcdef")//这样写是在比较2个字符串的首字符的地址
//	{
//		//err
//	}//两个字符串比较相等应该使用strcmp
//	return 0;
//}


//int main()
//{
//	int a = 3;
//	int b = 0;
//	//int c = a && b;//并且
//
//	int c = a || b;  //或者
//
//	printf("%d\n", c);
//
//	//if (a && b)
//	//{
//
//	//}
//	return 0;
//}

//&& 左边为假，右边就不计算了
//|| 左边为真，右边就不计算了


//int main()
//{
//	int a = 3;
//	int b = 0;
//
//	if (a > 5)
//		b = 3;
//	else
//		b = -3;
// 
//	(a > 5) ? (b = 3) : (b = -3);
// 
//	b = (a > 5 ? 3 : -3);
//
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	a = get_val();
//	count_val(a);
//	while (a > 0)
//	{
//		//业务处理
//		a = get_val();
//		count_val(a);
//	}
//
//	//用逗号表达式，改写
//	while (a = get_val(), count_val(a), a > 0)
//	{
//		//业务处理
//	}
//	return 0;
//}


//int main()
//{
//	int arr[10] = { 0 };
//	//arr[7] --> *(arr+7) --> *(7+arr) --> 7[arr]
//	//arr是数组首元素地址
//	//arr+7就是跳过 7 个元素，指向了第 8 个元素
//	//*(arr+7) 就是第 8 个元素
//
//	arr[7] = 8;
//	7[arr] = 9;//都是可以的（访问时可以，创建不行）
//	//[] 的操作数一个是 arr 一个是 7
//
//	return 0;
//}

//函数定义
//int Add(int x, int y)
//{
//	return (x + y);
//}
//int main()
//{
//	int a = 10;
//	int b = 20;
//	//函数调用
//	int c = Add(a, b);//()	就是函数调用操作符，操作数：Add，a，b
//	
//	return 0;
//}

//#include <string.h>
//
//struct Stu
//{
//	char name[20];
//	int age;
//	double score;
//};
//
//void set_Stu(struct Stu* ps)
//{
//	//strcpy((*ps).name, "miku");
//	//(*ps).age = 16;
//	//(*ps).score = 100.0;
//
//	strcpy(ps->name, "miku");
//	ps->age = 16;
//	ps->score = 100.0;//ps->age 等价于 (*ps).age
//}
//
//void print_Stu(struct Stu ss)
//{
//	printf("%s %d %lf\n", ss.name, ss.age, ss.score);
//}
//
//int main()
//{
//	struct Stu s = { 0 };
//	set_Stu(&s);
//	print_Stu(s);
//	return 0;
//}


//int main()
//{
//	char c = -1;//-1是整数，32个比特位
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111 -> -1的补码
//	//11111111 -> c里放的东西
//	//11111111111111111111111111111111
//
//	return 0;
//}

//整形家族在内存中都是存储补码
//int	4byte - 32bit
//char	1byte - 8bit

//int main()
//{
//	char a = 5;
//	//00000000000000000000000000000101
//	//00000101 - a里放的
//	//
//	char b = 126;
//	//00000000000000000000000001111110
//	//01111110 - b里放的
//
//	char c = a + b;
//	//00000000000000000000000000000101 - a
//	//00000000000000000000000001111110 - b
//	//00000000000000000000000010000011
//	//10000011 - c里放的
//	//11111111111111111111111110000011 - 补码
//	//11111111111111111111111110000010
//	//10000000000000000000000001111101
//
//	printf("%d\n", c);//-125
//
//	return 0;
//}
